Rails/webt/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM `articles`

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def edit
    @article = Article.find(params[:id])
    @article_contents = @article.article_contents.find_by_article_id(@article.id)
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 9)
SELECT * FROM `article_contents` WHERE (`article_contents`.`article_id` = 9) AND (`article_contents`.article_id = 9) LIMIT 1

  def create
    @article = Article.new(params[:article])
    @article_content=@article.article_contents.build(params[:article_contents])
    respond_to do |format|
      if @article.save
---
INSERT INTO `article_contents` (`title`, `description`, `content`, `published_at`, `created_at`, `updated_at`, `status_confirmed`, `article_id`) VALUES('test url', 'test ', 'it works or not', NULL, '2010-07-13 16:55:30', '2010-07-13 16:55:30', NULL, 9)
INSERT INTO `articles` (`title`, `description`, `content`, `created_at`, `updated_at`, `published_at`) VALUES('First article', 'testing for the articles', 'test for better articles', '2010-07-11 05:25:36', '2010-07-11 05:25:36', '2010-07-11 04:53:00')

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 8)
DELETE FROM `articles` WHERE `id` = 8